stress_test.yml
config:
  target: "http://localhost:3004"
  processor: "./stressTestFunctions.js"
  ensure:
    p95: 2000
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
scenarios:
  - name: "Get Reviews and info for A Restaurant"
    flow:
      - function: "generateGetRequestData"
      - loop:
        - get:
            url: "/{{ restaurantId }}/reviews"
            json:
              sort: "{{ sort }}"
              star: "{{ star }}"
              keywords: "{{ keywords }}"
        count: 100